;Place localized text in this file


[BHGWeapon X2WeaponTemplate]
FriendlyName="黑洞发生器"
BriefSummary="黑洞发生器是我们创造过的最强大的武器，但在发射前必须激活，以获得最大的效能。"
TacticalText="<Bullet/>在正常情况下造成很小的损害。激活黑洞发生器后大量增加武器的伤害和裂甲效果。\n<Bullet/>由于其量子特性，总是会破坏掩体并产生大面积的影响。发射武器需要两个行动点。"

[BHGAbility X2AbilityTemplate]
LocFriendlyName="发生器喷射"
LocHelpText="未激活直接喷射，造成伤害很小"


[BHGAbilityPrime X2AbilityTemplate]
LocFriendlyName="激活黑洞发生器"
LocHelpText="激活黑洞发生器，以大大增加伤害和裂甲效果。启动持续一个回合。"
LocFlyOverText="已激活！"
LocPromotionPopupText="<Bullet/> 已激活！<br/>"
